{"name": "Atlanta Hawks", "injuries": [{"full_name": "Cam Reddish", "shortComment": "out", "longComment": "out", "dateUpdated": "2022-01-01T01:52Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Ankle", "location": "Leg", "detail": "Sprain", "side": "Right", "returnDate": "2022-01-03"}, "player_id": 1629629}, {"full_name": "Malik Ellison", "shortComment": "Ellison was placed in the NBA's COVID-19 protocols on Tuesday, Adrian Wojnarowski of ESPN reports.", "longComment": "The Hawks signed Ellison to a hardship deal last week, but he has not appeared in any games, and he'll now be subject to quarantine for the next several days. By the time Ellison clears protocols, chances are the Hawks will have enough of their regulars back that he won't be a factor in the rotation.", "dateUpdated": "2021-12-28T17:09Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-03"}}, {"full_name": "Gorgui Dieng", "shortComment": "Dieng was placed in the NBA's COVID-19 protocols on Tuesday, Adrian Wojnarowski of ESPN reports.", "longComment": "The big man becomes the latest Hawk to enter protocols, as the team's total has now reached 12 players. He'll likely miss at least the next two games -- Wednesday at CHI; Friday at CLE -- but could test out of protocols early next week.", "dateUpdated": "2021-12-28T17:06Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-03"}, "player_id": 203476}, {"full_name": "Bogdan Bogdanovic", "shortComment": "Bogdanovic was placed in the NBA's COVID-19 protocols on Tuesday, Adrian Wojnarowski of ESPN reports.", "longComment": "Bogdanovic, Gorgui Dieng and Malik Ellison were each added to protocols Tuesday, adding to the Hawks' ongoing outbreak that now includes 12 players. Bogdanovic will likely miss at least the next six days, but the hope is that he may be able to return for Monday's game at Portland or next Wednesday's game at Sacramento.", "dateUpdated": "2021-12-28T17:05Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 203992}, {"full_name": "Delon Wright", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-27T16:03Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-07"}, "player_id": 1626153}, {"full_name": "Kevin Huerter", "shortComment": "Huerter (COVID-19) will not return for Monday's game against the Bulls, Chris Vivlamore of The Atlanta Journal-Constitution reports.", "longComment": "Huerter has already missed three games since entering the league's health and safety protocols and is set to miss another, as it has been confirmed he will not be cleared in time for Monday's meeting with the Bulls. The Hawks are now up to 10 players in the league's protocols and will hope to get some healthy bodies back for when the travel to Chicago to play the Bulls again.", "dateUpdated": "2021-12-26T17:14Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1628989}, {"full_name": "Jalen Johnson", "shortComment": "Johnson entered the league's COVID-19 protocols Sunday, Adrian Wojnarowski of ESPN reports.", "longComment": "Johnson is the second Hawks player to be placed in the league's health and safety protocols Sunday morning and is the 10th player overall. John Collins was also placed into protocols, leaving the Hawks severely undermanned at the power forward position. Don't be surprised if the team signs another player via a hardship deal ahead of Monday's meeting with the Bulls.", "dateUpdated": "2021-12-26T16:52Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-05"}, "player_id": 1630552}, {"full_name": "John Collins", "shortComment": "Collins entered the league's health and safety protocols Sunday, Adrian Wojnarowski of ESPN reports.", "longComment": "Collins becomes the ninth Hawks player to be placed into league protocols. He had just played against the Knicks on Christmas, scoring 20 points (7-18 FG, 3-5 3Pt, 3-4 FT) to go along with eight rebounds, three assists and two blocks in 33 minutes. The Hawks are hoping to get a handful of their guys back from protocol this week but may be without Collins for the next 10 days unless he's able to produce two negative PCR tests within a 24 hour period. Jalen Johnson also joined Collins in protocols this morning, leaving the Hawks with some major holes at the power forward position.", "dateUpdated": "2021-12-26T16:47Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-05"}, "player_id": 1628381}, {"full_name": "Onyeka Okongwu", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-24T22:07Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1630168}, {"full_name": "Sharife Cooper", "shortComment": "Cooper entered the league's health and safety protocols Thursday, Chris Kirschner of The Athletic reports.", "longComment": "Cooper was recalled from the G League earlier in the week and saw some action in Wednesday night's loss to the Magic. He would've been in line for more minutes Thursday night in Philly, but he'll now likely miss the next 7-to-10 days.", "dateUpdated": "2021-12-23T23:12Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630536}, {"full_name": "Timothe Luwawu-Cabarrot", "shortComment": "Luwawu-Cabarrot was placed in the league's health and safety protocols Wednesday, Mike Conti of the Atlanta Hawks Radio Network reports.", "longComment": "Luwawu-Cabarrot and Lou Williams were both placed in COVID-19 protocols Wednesday, bringing Atlanta's total to five players sidelined due to the league's health and safety rules. Their absence will likely open the door for Lance Stephenson and Malcolm Hill, who were both recently signed to 10-day contracts, to crack Nate McMillan's rotation.", "dateUpdated": "2021-12-22T16:51Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1627789}, {"full_name": "Danilo Gallinari", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-21T18:08Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 201568}, {"full_name": "De'Andre Hunter", "shortComment": "Hawks general manager Travis Schlenk said Tuesday that Hunter (wrist) is \"two to three weeks away\" from returning to game action, Mike Conti of the Atlanta Hawks Radio Network reports.", "longComment": "When Hunter underwent surgery on his right wrist Nov. 14, the initial projection for his recovery time was set at around eight weeks, but the third-year forward looks like he's on track to beat that timetable. Assuming he hits no further snags in his rehab program from surgery, Hunter looks like he'll be back on the court by the first week of January, if not the tail end of December. Kevin Huerter and Timothe Luwawu-Cabarrot have been filling in as Atlanta's starters on the wing while Hunter and Bogdan Bogdanovic (ankle) have been sidelined with multi-week injuries.", "dateUpdated": "2021-12-14T16:59Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Wrist", "location": "Arm", "detail": "Surgery", "side": "Right", "returnDate": "2022-01-03"}, "player_id": 1629631}, {"full_name": "Solomon Hill", "shortComment": "The Hawks announced Wednesday that Hill suffered a right hamstring tear in Sunday's 130-127 loss to the Hornets that will require season-ending surgery.", "longComment": "Hill will finish the 2021-22 campaign with averages of 0.6 points and 1.8 rebounds in 10.7 minutes per game across 13 appearances. The veteran forward wasn't a major contributor for the Hawks, but his absence will further test Atlanta's depth with Bogdan Bogdanovic (ankle) and De'Andre Hunter (wrist) both expected to remain out for multiple weeks.", "dateUpdated": "2021-12-08T17:23Z", "details": {"fantasyStatus": {"description": "out for season", "abbreviation": "OFS"}, "type": "Hamstring", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-08-01"}, "player_id": 203524}], "dateUpdated": "2022-01-01 05:55:06.697925"}