{"name": "Brooklyn Nets", "injuries": [{"full_name": "Kyrie Irving", "shortComment": "Irving could return to action as soon as Jan. 5 against the Pacers, though coach Steve Nash said that there is \"no urgency\" to rush the star guard back into action, Kristian Winfield of the New York Daily News reports. \"I don't think it's smart to rush him into games,\" Nash said Wednesday. \"There's only 50 games left. It's when he's ready. If he's ready for Indiana, great. If he's not, we push it to the next one.\"", "longComment": "Irving officially cleared COVID-19 protocols earlier in the week, but he'll require a ramp-up period considering he has not played this season. Just how long that period will be remains to be seen, but given that Irving can only play in road games, his options are fairly limited over the next few weeks, as the Nets play seven of their next nine games in Brooklyn. If he doesn't end up playing on Jan. 5, his return would likely come a week later when the Nets take on the Bulls in Chicago.", "dateUpdated": "2021-12-29T18:42Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Not Injury Related", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 202681}, {"full_name": "Joe Harris", "shortComment": "Coach Steve Nash said Monday that Harris will undergo left ankle surgery, but he is expected to return this season, Shams Charania of The Athletic reports.", "longComment": "Nash said that the surgery will be a scope to clear up \"a little bone particle\" in his left ankle, according to Ohm Youngmisuk of ESPN.com. Adrian Wojnarowski of ESPN reports that the 6-foot-6 shooting guard is expected to miss four to eight weeks, which is a pretty vague timetable. However, the good news is that he is expected to return for Brooklyn this season. Patty Mills, who is averaging 18.2 points (on 57.9 percent shooting from the field) during his last five starts, is expected to continue to draw starts during Harris' absence, while the likes of DeAndre' Bembry and Cam Thomas see increased roles off the bench.", "dateUpdated": "2021-11-29T18:51Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Ankle", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-01"}, "player_id": 203925}], "dateUpdated": "2022-01-01 05:55:06.729168"}