{"name": "Charlotte Hornets", "injuries": [{"full_name": "Scottie Lewis", "shortComment": "Lewis was placed in the league's health and safety protocols Monday.", "longComment": "Lewis has only made two appearances at the NBA level this season, so his absence shouldn't impact Charlotte's rotations. The G League has postponed all games until Jan. 4, so the rookie second-round pick should have ample time to clear protocols before the Greensboro Swarm return to action.", "dateUpdated": "2021-12-27T21:39Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-06"}, "player_id": 1630575}, {"full_name": "P.J. Washington", "shortComment": "Washington has entered the NBA's health and safety protocols Sunday.", "longComment": "Both Washington and Miles Bridges were simultaneously placed into the NBA's health and safety protocols Sunday, ruling them out for Monday's meeting against the Rockets. The 23-year-old Washington has been one of the team's top bench options, averaging 10.9 points, 5.2 rebounds, 2.3 assists and 1.1 blocks in 25.1 minutes per game. Jalen McDaniels figures to slide into the starting five with both Washington and Bridges sidelined.", "dateUpdated": "2021-12-26T21:56Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1629023}, {"full_name": "Miles Bridges", "shortComment": "Bridges was placed into the NBA's health and safety protocols Sunday.", "longComment": "Both Bridges and P.J. Washington were simultaneously placed in the league's health and safety protocols, joining Cody Martin as the Hornets' players currently sidelined due to COVID-19. The loss of Bridges and Washington leaves the team without their top two options at power forward, likely prompting head coach James Borrego to start Jalen McDaniels instead. The earliest Bridges could return would be Jan. 5 against Detroit unless he's able to produce consecutive negative PCR tests within a 24-hour span.", "dateUpdated": "2021-12-26T21:53Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1628970}], "dateUpdated": "2022-01-01 05:55:06.744790"}