{"name": "Chicago Bulls", "injuries": [{"full_name": "Alex Caruso", "shortComment": "Caruso (foot) did travel with the team for their upcoming two-game road trip, K.C. Johnson of NBC Sports Chicago reports.", "longComment": "The first-year Bull has missed the team's last three contests and will not be able to return to the court on Chicago's upcoming road trip. Coby White and Ayo Dosunmu figure to continue to share the load at point guard in both Caurso's and Lonzo Ball's (COVID-19) absences. The defensive specialist's next chance to get back in the Bulls' lineup comes Monday against the Magic.", "dateUpdated": "2021-12-31T18:39Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Foot", "location": "Leg", "detail": "Sprain", "side": "Left", "returnDate": "2022-01-03"}, "player_id": 1627936}, {"full_name": "Marko Simonovic", "shortComment": "Simonovic was placed in the league's health and safety protocols Wednesday, Rob Schaefer of NBC Sports Chicago reports.", "longComment": "Simonovic has only made four appearances for the Bulls this season, so his potential absence shouldn't impact Chicago's game plan. Nonetheless, COVID-19 continues to ravaged the Bulls' locker room, as Simonovic is now the 17th player to enter COVID-19 protocols this season.", "dateUpdated": "2021-12-29T16:58Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630250}, {"full_name": "Ersan Ilyasova", "shortComment": "Ilyasova (COVID-19 protocols) is listed as out for Wednesday's contest against the Hawks.", "longComment": "Based on Chicago's injury report, Ilyasova was placed in the league's health and safety protocols Tuesday. The veteran forward signed a 10-day hardship contract with the Bulls on Dec. 21, but he hasn't made an appearance for his new squad.", "dateUpdated": "2021-12-28T21:42Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 101141}, {"full_name": "Lonzo Ball", "shortComment": "Ball was placed in the NBA's health and safety protocols Thursday, Adrian Wojnarowski of ESPN reports.", "longComment": "Ball was one of the few members of the Bulls who had yet to enter the league's COVID-19 protocols coming into Sunday but could only hide for so long. He becomes the third player for Chicago to be placed in protocols Sunday, joining Alonzo McKinnie and Tony Bradley. Coby White should slide into the starting five while Ball is out. The earliest he could return would be Jan. 7 against the Wizards unless he's able to have two consecutive negative PCR tests within a 24-hour span.", "dateUpdated": "2021-12-26T18:24Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-07"}, "player_id": 1628366}, {"full_name": "Alfonzo McKinnie", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-26T16:36Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-07"}, "player_id": 1628035}, {"full_name": "Tony Bradley", "shortComment": "Bradley was placed in the league's health and safety protocols Sunday, Darnell Mayberry of The Athletic reports.", "longComment": "Bradley and Alfonzo McKinnie are the latest Bulls players to land in COVID-19 protocols. In Bradley's absence, Tyler Cook, Marko Simonovic and Ersan Ilyasova will likely all compete for backup minutes behind Nikola Vucevic.", "dateUpdated": "2021-12-26T16:33Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1628396}, {"full_name": "Patrick Williams", "shortComment": "Williams (wrist) will undergo surgery to repair torn ligaments in his left wrist from an injury sustained during Thursday's matchup with the Knicks and is expected to miss four-to-six months.", "longComment": "Initial reports stated that Williams would miss the rest of the regular season, but if he is able to return by the four-month mark, then he would be back by late February, which would give him ample time to gear up for the playoffs. If his return is closer to the six-month mark, then he will likely be out through the first-round of the playoffs. After their offseason acquisitions of Lonzo Ball, DeMar DeRozan and Alex Caruso, the Bulls are expected to make the playoffs, so a postseason return could be in the cards for Williams. However, the most likely chance of him playing again this season would involve him progressing well throughout rehab and avoiding setbacks. Troy Brown, Javonte Green and Alize Johnson will all be candidates for increased role during Williams' absence.", "dateUpdated": "2021-10-29T20:01Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Wrist", "location": "Arm", "detail": "Surgery", "side": "Left", "returnDate": "2022-04-10"}, "player_id": 1630172}], "dateUpdated": "2022-01-01 05:55:06.776032"}