{"name": "Cleveland Cavaliers", "injuries": [{"full_name": "Ricky Rubio", "shortComment": "Rubio's MRI confirmed that he suffered a torn ACL Tuesday against the Pelicans, Adrian Wojnarowski of ESPN reports.", "longComment": "This is just devasting news for the Cavaliers as the veteran point guard had been playing at a career-best level this season with Cleveland. Rubio had averaged 13.1 points, 4.1 rebounds and 6.6 assists across his first 34 appearances with the Cavaliers. Kevin Pangos should see more usage with Rubio sidelined, but it would not be surprising to see the team look into the free-agent market for a veteran replacement. Rubio's season is most likely done and the 31-year-old will now be looking forward to his 2022-23 return next season.", "dateUpdated": "2021-12-29T22:36Z", "details": {"fantasyStatus": {"description": "out for season", "abbreviation": "OFS"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-10-01"}, "player_id": 201937}, {"full_name": "Darius Garland", "shortComment": "Garland was placed in the league's health and safety protocols Tuesday, Adrian Wojnarowski of ESPN reports.", "longComment": "Garland has been nothing short of spectacular this year, averaging 19.5 points, 7.3 assists, 3.0 rebounds and 1.4 steals across 34.2 minutes per game while leading the Cavaliers to a surprising 20-13 record. Kevin Pangos and RJ Nembhard are expected to see increased playing time during the duration of Garland's absence.", "dateUpdated": "2021-12-28T17:58Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-04"}, "player_id": 1629636}, {"full_name": "Cedi Osman", "shortComment": "Osman (COVID-19 health and safety protocols) won't play Sunday against the Raptors, Tom Withers of the Associated Press reports.", "longComment": "Though he was placed in the protocols just a day ago, the Cavaliers were optimistic that Osman would test out of the protocols without missing a game. That won't be the case, but Osman looks like he might be able to return as soon as Tuesday's game against the Pelicans. Osman is one of eight Cavaliers in the protocols as of Sunday, and the team is also without Collin Sexton (knee) for the rest of the season due to injury.", "dateUpdated": "2021-12-26T19:42Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 1626224}, {"full_name": "Collin Sexton", "shortComment": "Sexton (knee) will miss the remainder of the season after undergoing surgery on his left meniscus tear, Shams Charania of The Athletic reports.", "longComment": "This is a tough blow for both Sexton and the Cavaliers. He was averaging 16.0 points, 3.3 rebounds, 2.1 assists, 0.9 steals and 1.0 triples across 28.7 minutes in 11 games before suffering the injury. Ricky Rubio will presumably continue to start at guard opposite Darius Garland going forward. Sexton and the team were unable to come to terms on a long-term deal prior to the season, which leaves him as an unrstricted free agent entering the 2021-22 offseason.", "dateUpdated": "2021-11-20T02:07Z", "details": {"fantasyStatus": {"description": "out for season", "abbreviation": "OFS"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-10-01"}, "player_id": 1629012}], "dateUpdated": "2022-01-01 05:55:06.791654"}