{"name": "Denver Nuggets", "injuries": [{"full_name": "Vlatko Cancar", "shortComment": "Cancar (illness) is questionable for Saturday's game against the Rockets, Harrison Wind of TheDNVR.com reports.", "longComment": "Cancar missed Tuesday's game against the Warriors with an illness but has a chance to return Saturday. If he's available, his workload will be determined based on whether Aaron Gordon (hamstring) and Austin Rivers (thumb) are able to play.", "dateUpdated": "2021-12-31T23:14Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Illness", "location": "Other", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-01"}, "player_id": 1628427}, {"full_name": "Aaron Gordon", "shortComment": "Gordon (hamstring) is questionable for Saturday's matchup against the Rockets, Harrison Wind of TheDNVR.com reports.", "longComment": "Gordon last played Dec. 22 and has been battling a hamstring injury since. If he's out Saturday, more minutes will be available for JaMychal Green, Davon Reed and other available forwards.", "dateUpdated": "2021-12-31T23:13Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Hamstring", "location": "Leg", "detail": "Soreness", "side": "Left", "returnDate": "2022-01-01"}, "player_id": 203932}, {"full_name": "Austin Rivers", "shortComment": "Rivers (thumb) is questionable for Saturday's game against the Rockets, Harrison Wind of TheDNVR.com reports.", "longComment": "Rivers is dealing with a sprained right thumb ahead of Saturday's matchup. If he's unavailable against Houston, Vlatko Cancar (illness) and Davon Reed could see additional run.", "dateUpdated": "2021-12-31T23:11Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Thumb", "location": "Arm", "detail": "Sprain", "side": "Right", "returnDate": "2022-01-01"}, "player_id": 203085}, {"full_name": "Monte Morris", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-31T23:06Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Soreness", "side": "Left", "returnDate": "2022-01-07"}, "player_id": 1628420}, {"full_name": "Zeke Nnaji", "shortComment": "Nnaji was placed in COVID-19 protocols Thursday,  Adrian Wojnarowski of ESPN reports.", "longComment": "Nnaji, Jeff Green and Bones Hyland -- as well as head coach Michael Malone -- all entered protocols Thursday morning, and the Nuggets will conduct further tests to see if any more players are positive for the virus. If that's the case, they could have trouble fielding enough players for Thursday night's matchup against the Warriors, per Wojnarowski.", "dateUpdated": "2021-12-30T17:04Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1630192}, {"full_name": "Bones Hyland", "shortComment": "Hyland entered the league's health and safety protocols Thursday, Adrian Wojnarowski of ESPN reports.", "longComment": "Hyland had appeared in nine of the last 10 games, but he'll now be forced to spend some time away from the team. A timetable for his return hasn't been established, and it's not yet clear whether he's tested positive for COVID-19. Facundo Campazzo and Davon Reed could see increased run in his absence.", "dateUpdated": "2021-12-30T17:04Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}}, {"full_name": "Jeff Green", "shortComment": "Green has entered the league's health and safety protocols, Adrian Wojnarowski of ESPN reports.", "longComment": "Green was one of three Nuggets who were placed in the league's COVID-19 protocols Thursday. It's not yet clear whether he's tested positive for the virus or when he'll be able to return, but Aaron Gordon (hamstring), JaMychal Green and Bol Bol could see increased run in his absence.", "dateUpdated": "2021-12-30T17:01Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 201145}, {"full_name": "Markus Howard", "shortComment": "Howard sprained his left knee during Denver's loss to the Timberwolves on Wednesday and will be re-evaluated in six weeks.", "longComment": "The second-year guard exited Wednesday's contest in the fourth quarter with a knee injury, but thankfully will not be lost for the entire season. Bones Hyland, Facundo Campazzo, and Austin Rivers all figure to see a little boost in usage with Howard on the sideline. The Nuggets can't seem to buy a break with injuries as Howard joins Michael Porter (back), Jamal Murray (knee) and PJ Dozier (knee) on the bench.", "dateUpdated": "2021-12-17T19:07Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Sprain", "side": "Left", "returnDate": "2022-02-01"}, "player_id": 1630210}, {"full_name": "Michael Porter Jr.", "shortComment": "Porter (back) will undergo surgery Wednesday on his lower back, Adrian Wojnarowski of ESPN reports.", "longComment": "While Porter is expected to make a full recovery, this is close to the worst-case scenario for the 23-year-old, who's already undergone a pair of surgeries on his back, which has been an issue dating back to his days as a high school standout. As of now, no return timetable has been handed down, but more details are expected to emerge later this week once the procedure is complete. Whether the surgery ultimately spells the end of Porter's 2021-22 season remains to be seen, but fantasy managers should brace for a multi-month absence, regardless.", "dateUpdated": "2021-11-29T16:35Z", "details": {"fantasyStatus": {"description": "out for season", "abbreviation": "OFS"}, "type": "Back", "location": "Torso", "detail": "Surgery", "side": "Not Specified", "returnDate": "2022-10-01"}, "player_id": 1629008}, {"full_name": "P.J. Dozier", "shortComment": "Dozier (knee) suffered a torn ACL Tuesday against the Trail Blazers and is out indefinitely, Brendan Vogt of The DNVR.com reports.", "longComment": "As expected, Dozier will presumably be out the remainder of the year as a result of a torn ACL. He ends the season having appeared in 18 games with averages of 5.4 points, 3.5 rebounds and 1.6 assists in 18.9 minutes. In his absence, more minutes could be available for Bones Hyland, Vlatko Cancar and Zeke Nnaji.", "dateUpdated": "2021-11-24T23:44Z", "details": {"fantasyStatus": {"description": "out for season", "abbreviation": "OFS"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-11-01"}}, {"full_name": "Jamal Murray", "shortComment": "Murray (knee) is progressing in his rehab from a torn ACL but remains without a timetable, David Aldridge of The Athletic reports.", "longComment": "It's been roughly five months since Murray underwent surgery, and while he's still a ways away from returning to game action, Aldridge notes that the Nuggets are \"very happy with Murray's progress and rehab.\" Given Murray's age and work ethic, it would not be a surprise if he's ahead of schedule, though it remains to be seen if he'll return early enough in the season to make any sort of fantasy impact. For now, Murray is probably only worth a late-round flier in leagues that include multiple IR spots.", "dateUpdated": "2021-09-23T17:53Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-03-01"}, "player_id": 1627750}], "dateUpdated": "2022-01-01 05:55:06.869760"}