{"name": "Detroit Pistons", "injuries": [{"full_name": "Frank Jackson", "shortComment": "Jackson (ankle) will be re-evaluated in 7-10 days after being diagnosed with a lateral right ankle sprain, Rod Beard of The Detroit News reports.", "longComment": "Jackson sprained his ankle Wednesday against the Knicks. His injury adds to the extensive injury list of the Pistons, though Cade Cunningham and Killian Hayes appear on track to return soon from protocols.", "dateUpdated": "2021-12-30T19:39Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Ankle", "location": "Leg", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-06"}, "player_id": 1628402}, {"full_name": "Kelly Olynyk", "shortComment": "Olynyk (knee) is continuing to rehab his sprained left knee and is without a firm return timetable, Rod Beard of the Detroit News reports.", "longComment": "When he suffered the injury back in November, Olynyk was initially given a six-week timetable, but he's now passed the seven-week mark and his return does not appear imminent. Coach Dwane Casey said Olynyk has been working on his conditioning of late, but it doesn't sound like he's returned to practice yet. That next step could come soon, but Olynyk will likely remain out for at least another week or two.", "dateUpdated": "2021-12-30T19:24Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Sprain", "side": "Left", "returnDate": "2022-01-08"}, "player_id": 203482}, {"full_name": "Cade Cunningham", "shortComment": "Cunningham (COVID-19 protocols) is  listed as out for Wednesday's game against the Knicks.", "longComment": "Cunningham entered protocols a week ago, so under the league's new quarantine policy there was a possibility that he could be cleared, but it looks as though he'll miss at least one more contest. This will be the third straight absence for the No. 1 overall pick, who last played on Dec. 21 against the Knicks. With a number of other contributors in protocols for the Pistons, expect hardship signee Derrick Walton to make another start at point guard.", "dateUpdated": "2021-12-29T18:54Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630595}, {"full_name": "Josh Jackson", "shortComment": "Jackson entered the NBA's health and safety protocols Sunday morning, James L. Edwards III of The Athletic reports.", "longComment": "Both Jackson and Cory Joseph were placed into protocols Sunday morning, bringing the Pistons' total to nine players. The team also has an additional three players sidelined with injury, as it's starting to become a problem for them to potentially roster the minimum amount of players needed for a game. The Pistons are set to play the Spurs Sunday night but that game could certainly be in question due to the lack of bodies the team will have. If the game does indeed end up being played, Saddiq Bey, Frank Jackson and Hamidou Diallo will be the only players available from their typical rotation.", "dateUpdated": "2021-12-26T15:42Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1628367}, {"full_name": "Cory Joseph", "shortComment": "Joseph entered the NBA's health and safety protocols Sunday morning, James L. Edwards III of The Athletic reports.", "longComment": "Both Joseph and Josh Jackson entered the league's protocols Sunday morning, putting the Pistons down 11 guys for Sunday's game. It's unclear if Sunday's meeting against the Spurs will continue as planned. If it does, Saddiq Bey, Frank Jackson and Hamidou Diallo will be the only regular rotatio players still active.", "dateUpdated": "2021-12-26T15:37Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 202709}, {"full_name": "Trey Lyles", "shortComment": "Lyles entered health and safety protocols Saturday.", "longComment": "Coming off a career performance, Lyles has been placed in protocols. His absence, with Isiah Stewart (COVID-19 protocols) also out, means Luka Garza should see a significant increase in role.", "dateUpdated": "2021-12-25T22:57Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1626168}, {"full_name": "Rodney McGruder", "shortComment": "McGruder was placed in the league's health and safety protocols Thursday, James L. Edwards III of The Athletic reports.", "longComment": "It's not yet clear whether McGruder has tested positive for COVID-19, but he joins several of his teammates in the league's protocols. He'll be unavailable Thursday against the Heat and could miss additional contests, while Josh Jackson and Saddiq Bey could see increased run in his absence.", "dateUpdated": "2021-12-23T22:51Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 203585}, {"full_name": "Isaiah Stewart", "shortComment": "Stewart landed in COVID-19 protocols Thursday, Adrian Wojnarowski of ESPN reports.", "longComment": "Stewart, Killian Hayes and Saben Lee were reported to have entered protocols at the same time ahead of Thursday's game against the Heat. With Stewart sidelined, Luka Garza, Trey Lyles and Cheick Diallo should see increased roles.", "dateUpdated": "2021-12-23T22:33Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630191}, {"full_name": "Killian Hayes", "shortComment": "Hayes entered the league's health and safety protocols Thursday, Adrian Wojnarowski of ESPN reports.", "longComment": "Hayes was believed to be dealing with a non-COVID illness earlier in the week, but he'll now be one of several Pistons who are unavailable due to the health and safety protocols. Cory Joseph and Frank Jackson (ankle) should see plenty of run in the backcourt in Hayes' absence.", "dateUpdated": "2021-12-23T22:33Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630165}, {"full_name": "Saben Lee", "shortComment": "Lee entered the league's health and safety protocols Thursday, Adrian Wojnarowski of ESPN reports.", "longComment": "The Pistons are just the latest team to have a COVID-19 outbreak as they prepare to face the Miami Heat on Thursday night. The fate of that game could be in jeopardy, but on an individual level, Lee figures to miss 7-to-10 days, effectively ruling him out for at least the next four scheduled contests.", "dateUpdated": "2021-12-23T22:32Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630240}, {"full_name": "Jerami Grant", "shortComment": "Grant will be re-evaluated in six weeks after undergoing surgery to repair a torn UCL in his left thumb Friday, Omari Sankofa II of the Detroit Free Press reports.", "longComment": "Grant was ruled out for at least six weeks when the thumb sprain was announced by the Pistons last weekend, so it doesn't appear the procedure may not significantly alter his recovery timeline. The 27-year-old will be re-evaluated in early February and may be sidelined for a few weeks thereafter, depending on his progress.", "dateUpdated": "2021-12-17T20:29Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Thumb", "location": "Arm", "detail": "Surgery", "side": "Right", "returnDate": "2022-02-01"}, "player_id": 203924}, {"full_name": "Chris Smith", "shortComment": "Smith (knee) didn't take the court Saturday in the G League Motor City Cruise's 140-117 win over the Cleveland Charge.", "longComment": "Smith, who inked a two-way deal with the Pistons in August, is expected to make his professional debut in the G League rather than with the NBA club once he makes a full recovery from the left knee surgery he required earlier this year. The 6-foot-9 forward is believed to be close to gaining full clearance for basketball activities, so he could suit up for Motor City in the near future.", "dateUpdated": "2021-11-08T17:53Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-02"}, "player_id": 1814}], "dateUpdated": "2022-01-01 05:55:06.932245"}