{"name": "Golden State Warriors", "injuries": [{"full_name": "James Wiseman", "shortComment": "Wiseman (knee) entered health and safety protocols Wednesday, Kendra Andrews of NBC Sports Bay Area reports.", "longComment": "Wiseman was placed in COVID protocols Wednesday. The 20-year-old is still recovering from a meniscus tear and this update may postpone his return even further.", "dateUpdated": "2021-12-30T01:43Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-01-16"}, "player_id": 1630164}, {"full_name": "Draymond Green", "shortComment": "Green is likely to miss time after he entered the NBA's health and safety protocols Sunday, Shams Charania of The Athletic reports.", "longComment": "Green's placement in the protocols comes after he turned in a well-rounded line while plyaing 34 minutes in the Warriors' 116-107 Christmas Day victory over the Suns, with the forward registering eight points (3-7 FG, 2-4 3Pt), 10 assists, eight rebounds, three steals and three blocks in the contest. He becomes the fifth Warriors player to enter the health and safety protocols, and unless he can test out early, he'll likely miss Tuesday's game against the Nuggets and additional contests to follow. Golden State will likely turn to committee of Otto Porter, Juan Toscano-Anderson, Jonathan Kuminga, Nemanja Bjelica and Kevon Looney to cover Green's minutes.", "dateUpdated": "2021-12-26T20:53Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 203110}, {"full_name": "Damion Lee", "shortComment": "Lee entered the league's health and safety protocols Wednesday.", "longComment": "The guard became the third Warrior to be placed in the league's health and safety protocols. Lee had been averaging 8.4 points per game on 7.0 field goal attempts per game, so his absence does open up a small number of opportunities for the rest of the Warriors' roster. Gary Payton and Moses Moody may both be in line to see more usage with Lee watching from home.", "dateUpdated": "2021-12-22T22:49Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-01"}, "player_id": 1627814}, {"full_name": "Klay Thompson", "shortComment": "Thompson (Achilles) is targeting a return to the court in January, Adrian Wojnarowski of ESPN reports.", "longComment": "The Warriors are hopeful that Thompson will be able to make his season debut during one of the team's home games in January. The Warriors haven't ruled out a return for the Jan. 3 matchup against Miami, but they're more hopeful that Thompson will be available Jan. 9 against the Cavaliers or Jan. 18 against Detroit. The 21-year-old resumed 5-on-5 work in late November and has been working on his conditioning since then.", "dateUpdated": "2021-12-17T23:44Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Achilles", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-01-09"}, "player_id": 202691}], "dateUpdated": "2022-01-01 05:55:06.947895"}