{"name": "Houston Rockets", "injuries": [{"full_name": "Alperen Sengun", "shortComment": "Sengun (ankle) didn't return to Friday's game against the Heat, Coty Davis of USA Today reports.", "longComment": "Sengun left Friday's matchup in the first half after he recorded six points (1-1 FG, 1-1 3Pt, 3-4 FT), a rebound, a steal and a block in seven minutes. Coach Stephen Silas didn't offer a firm update regarding Sengun's status after the game but said that the 19-year-old is unlikely to play Saturday against the Nuggets. If he's ultimately held out, Daniel Theis and Usman Garuba should see additional run.", "dateUpdated": "2022-01-01T03:16Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Ankle", "location": "Leg", "detail": "Sprain", "side": "Right", "returnDate": "2022-01-01"}, "player_id": 1630578}, {"full_name": "DeJon Jarreau", "shortComment": "Jarreau entered health and safety protocols Thursday, Jonathan Feigen of the Houston Chronicle reports.", "longComment": "Jarreau joined the team on a hardship deal Tuesday but has landed in protocols himself. He might not get to see the court before his contract expires.", "dateUpdated": "2021-12-30T23:15Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-05"}, "player_id": 1630610}, {"full_name": "Garrison Mathews", "shortComment": "Mathews has entered the NBA's health and safety protocols, Adrian Wojnarowski of ESPN reports.", "longComment": "Mathews is just the latest player to enter protocols, so he'll likely be slated to miss the next 7-to-10 days, unless he can return a pair of negative tests within a 24-hour span. Mathews had been in the midst of a cold spell over his last seven games, averaging just 7.7 points and 1.3 threes on 27.1 percent shooting (23.7% 3Pt).", "dateUpdated": "2021-12-26T22:40Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1629726}, {"full_name": "D.J. Augustin", "shortComment": "Augustin was placed in the NBA's health and safety protocols Sunday, Kelly Iko of The Athletic reports.", "longComment": "Augustin is the first member of the Rockets to be placed into the league's COVID-19 protocol and certainly may not be the last. The 34-year-old guard has been averaging 5.4 points, 2.3 assists and 1.1 rebounds in 14.9 minutes per game. His absence should allow for Armoni Brooks to see some more minutes off the bench.", "dateUpdated": "2021-12-26T19:29Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 201571}, {"full_name": "John Wall", "shortComment": "Coach Stephen Silas said Monday that Wall is working into game shape as discussions continue regarding the guard potentially taking the court for the Rockets, Jonathan Feigen of the Houston Chronicle reports.", "longComment": "The two sides met this weekend in hopes of working out an arrangement in which Wall would play for Houston, but he opted to continue sitting out games after the team informed him he wouldn't be guaranteed a starting role. The 31-year-old is now working his way back into game shape, though it remains to be seen when, or if, he'll take the court for the Rockets this season.", "dateUpdated": "2021-11-29T23:36Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Not Injury Related", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-03-01"}, "player_id": 202322}], "dateUpdated": "2022-01-01 05:55:06.963489"}