{"name": "Miami Heat", "injuries": [{"full_name": "KZ Okpala", "shortComment": "Okpala (wrist) will not play Friday against the Rockets,  Anthony Chiang of the Miami Herald reports.", "longComment": "Okpala is still battling a sprained right wrist, and the fact that he's already been ruled out while the Heat are battling a massive COVID outbreak indicates that he may not be close to returning. With eight players in protocols, Miami will be extremely shorthanded once again. Miami was unable to play Wednesday's scheduled game against San Antonio due to a shortage of available players.", "dateUpdated": "2021-12-30T23:04Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Wrist", "location": "Arm", "detail": "Sprain", "side": "Right", "returnDate": "2022-01-02"}, "player_id": 1629644}, {"full_name": "Marcus Garrett", "shortComment": "Garrett has entered the league's health and safety protocols, Tim Reynolds of the Associated Press reports.", "longComment": "While it's not yet clear whether Garrett has tested positive for COVID-19, he'll be required to spend some time away from the team. Kyle Guy, Haywood Highsmith and Nik Stauskas could see a slight uptick in playing time in his absence.", "dateUpdated": "2021-12-30T23:03Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-05"}, "player_id": 1630585}, {"full_name": "Duncan Robinson", "shortComment": "Robinson has entered the league's health and safety protocols, Tim Reynolds of the Associated Press reports.", "longComment": "It's not yet clear whether Robinson has tested positive for COVID-19, and the Heat haven't revealed a timetable for his return. Tyler Herro, Caleb Martin and Kyle Guy should see increased run in Robinson's absence.", "dateUpdated": "2021-12-30T23:00Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1629130}, {"full_name": "Zylan Cheatham", "shortComment": "Cheatham was placed in the league's health and safety protocols Wednesday, Anthony Chiang of the Miami Herald reports.", "longComment": "Cheatham signed a 10-day hardship contract with the Heat on Dec. 21. However, he never made his debut with his new team before landing in the NBA's COVID-19 protocols himself. His future with Miami is unclear.", "dateUpdated": "2021-12-29T15:47Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1629597}, {"full_name": "Gabe Vincent", "shortComment": "Vincent was placed in the league's health and safety protocols Wednesday, Tim Reynolds of the Associated Press reports.", "longComment": "Over his last nine games, Vincent is averaging 14.3 points, 4.7 assists, 3.4 rebounds and 1.2 steals across 33.4 minutes per game. The Heat are still without Kyle Lowry due to COVID-19 protocols as well, so Vincent's absence will likely open the door for Tyler Herro to step into the starting lineup, while Kyle Guy and Marcus Garrett could see increased roles off the bench.", "dateUpdated": "2021-12-29T15:43Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1629216}, {"full_name": "P.J. Tucker", "shortComment": "Tucker was placed in the league's health and safety protocols Wednesday, Tim Reynolds of the Associated Press reports.", "longComment": "Tucker appeared close to making a return from a four-game absence due to lower leg inflammation. However, the veteran forward will now also have to clear the NBA's COVID-19 protocols before he returns to the court. In his absence, KZ Okpala is expected to see increased playing time.", "dateUpdated": "2021-12-29T15:36Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Inflammation", "side": "Left", "returnDate": "2022-01-05"}, "player_id": 200782}, {"full_name": "Max Strus", "shortComment": "Strus entered COVID-19 protocols Tuesday.", "longComment": "The Heat made the announcement only a half-hour before Tuesday's game against the Wizards tips off, so they'll shuffle the lineup once again and insert Caleb Martin in place of Strus, who started the previous three contests. The DePaul product proved to be a valuable streaming option for fantasy managers, averaging 22.6 points, 5.2 rebounds and 4.8 threes over the last five games. He'll now be subject to quarantine for at least the next six days, effectively ruling him out for at least the next four contests.", "dateUpdated": "2021-12-29T00:07Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1629622}, {"full_name": "Udonis Haslem", "shortComment": "Haslem was placed in the NBA's health and safety protocols Tuesday, Ira Winderman of the South Florida Sun Sentinel reports.", "longComment": "Normally, Haslem is not a part of the Heat's rotation, but he's played in each of the last three games amid injuries and COVID absences across the roster. He'll now be set to miss at least the next six days, so by the time he returns, Haslem will likely be back to DNP-CD status on the vast majority of nights.", "dateUpdated": "2021-12-28T17:35Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 2617}, {"full_name": "Markieff Morris", "shortComment": "Morris (neck)  will not play Tuesday against the Wizards and remains out indefinitely.", "longComment": "The Heat have not issued any real updates on Morris' status, but he continues to be listed as \"out\" on a game-to-game basis. The neck injury stems all the way back to Nov. 8, when he was plowed into by the Nuggets' Nikola Jokic. Tuesday will mark Morris' 25th consecutive absence.", "dateUpdated": "2021-12-27T21:39Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Neck", "location": "Head", "detail": "Soreness", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 202693}, {"full_name": "Dewayne Dedmon", "shortComment": "Dedmon (knee) was diagnosed with a Grade 1 MCL sprain Friday and is expected to be sidelined 1-to-2 weeks.", "longComment": "Dedmon suffered the injury during Thursday's matchup with the Pistons and will be sidelined for the closing stretch of 2021. If all goes well in his recovery the 32-year-old could retake the court next weekend, but it wouldn't be surprising if he faces a longer absence.", "dateUpdated": "2021-12-24T21:35Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Sprain", "side": "Left", "returnDate": "2022-01-02"}, "player_id": 203473}, {"full_name": "Bam Adebayo", "shortComment": "Adebayo underwent successful surgery Monday to repair a torn Ulnar Collateral Ligament in his right thumb and is expected to miss 4-to-6 weeks.", "longComment": "Adebayo suffered the injury during the Heat's loss to the Nuggets on Dec. 19 and initially tried playing through the pain before opting for surgery. The loss is huge for Miami, as the star big man was averaging 18.7 points, 10.2 rebounds, 3.2 assists and 1.1 steals across 32.9 minutes per game. Dewayne Dedmon (knee), P.J. Tucker and KZ Okpala are all expected to step up until Adebayo is cleared, which will likely be sometime in January.", "dateUpdated": "2021-12-07T19:09Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Thumb", "location": "Arm", "detail": "Surgery", "side": "Right", "returnDate": "2022-01-12"}, "player_id": 1628389}, {"full_name": "Victor Oladipo", "shortComment": "Oladipo (quadriceps) remains out for Saturday's game in Utah and is without a timeline for making his season debut, Ira Winderman of the South Florida Sun Sentinel reports.", "longComment": "As Winderman notes, Oladipo isn't even traveling with the Heat during its ongoing road trip, which suggests that the 29-year-old isn't especially close to playing. Until reports surface indicating that Oladipo has returned to full-court, full-contact practices, he can viewed as week-to-week rather than day-to-day.", "dateUpdated": "2021-11-13T18:54Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Quadriceps", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-01-15"}, "player_id": 203506}], "dateUpdated": "2022-01-01 05:55:07.122317"}