{"name": "Minnesota Timberwolves", "injuries": [{"full_name": "D'Angelo Russell", "shortComment": "Russell (COVID-19) is out for Friday's game against the Jazz, Dane Moore of BringMeTheNews.com reports.", "longComment": "Russell entered the league's health and safety protocols on Christmas Day and will continue to be sidelined Friday. He's technically eligible to return after the NBA shortened the mandatory isolation period from 10 days to six but he must be asymptomatic and meet other testing standards. Malik Beasley should continue to start in his place. His next chance to return will be Sunday against the Lakers.", "dateUpdated": "2021-12-31T01:26Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 1626156}, {"full_name": "McKinley Wright IV", "shortComment": "Wright was placed in the league's health and safety protocols Thursday.", "longComment": "Wright was transferred to the parent club Monday to provide additional depth, but he'll join a lengthy list of Timberwolves in the league's COVID-19 protocols. It's not yet clear when he'll be able to return.", "dateUpdated": "2021-12-23T23:05Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1630593}, {"full_name": "Karl-Anthony Towns", "shortComment": "Towns was placed in the league's health and safety protocols Thursday.", "longComment": "More and more players around the league continue to test positive for the virus, and Towns is just the latest victim. The Wolves now have seven players in protocols, so they'll be shorthanded for the next several games, including Thursday's game against Utah. Naz Reid (calf) will be available, however, so he figures to absorb a decent chunk of Towns' minutes.", "dateUpdated": "2021-12-23T23:03Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1626157}], "dateUpdated": "2022-01-01 05:55:07.153567"}