{"name": "New Orleans Pelicans", "injuries": [{"full_name": "Brandon Ingram", "shortComment": "Ingram (Achilles) is officially listed as questionable for Saturday's contest against the Bucks, Pelicans' broadcaster Erin Summers  reports.", "longComment": "Ingram practiced Friday for the first time since leaving Tuesday's contest against the Thunder after he played just nine minutes. Coach Willie Green said he's still considered day-to-day, so if he isn't able to suit up Saturday, then he will likely be available for Monday's contest against the Jazz.", "dateUpdated": "2021-12-31T21:11Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Achilles", "location": "Leg", "detail": "Soreness", "side": "Left", "returnDate": "2022-01-01"}, "player_id": 1627742}, {"full_name": "Josh Hart", "shortComment": "Hart (ankle) is probable for Saturday's matchup against the Bucks, Pelicans broadcaster Erin Summers reports.", "longComment": "Hart practiced Friday, which apparently went well since he's deemed probable. He'll likely only end up missing one game due to the ankle sprain. Over his past eight matchups, he's averaging 16.5 points, 9.1 rebounds, 5.5 assists and 1.1 steals in 37.6 minutes.", "dateUpdated": "2021-12-31T21:07Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Ankle", "location": "Leg", "detail": "Sprain", "side": "Left", "returnDate": "2022-01-01"}, "player_id": 1628404}, {"full_name": "Jonas Valanciunas", "shortComment": "Valanciuans has been placed in the league's health and safety protocols, Andrew Lopez of ESPN.com reports.", "longComment": "The 6-foot-11 center had missed two out of the Pelicans' last three contests due to an illness but is now set to miss even more time after being placed in the league's health and safety protocols. Willy Hernangomez and Jaxson Hayes both figure to see more playing time with Valanciunas sidelined. New Orleans is scheduled to play in four contests next week.", "dateUpdated": "2021-12-31T19:19Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-06"}, "player_id": 202685}, {"full_name": "Jose Alvarado", "shortComment": "Alvarado entered the NBA's COVID-19 health and safety protocols prior to the Pelicans' 108-104 win over the Cavaliers on Tuesday, Andrew Lopez of ESPN.com reports.", "longComment": "The two-way rookie is one of three Pelicans included in the protocols, joining Nickeil Alexander-Walker and Naji Marshall. Even when available this season, Alvarado hasn't regularly factored into the New Orleans rotation.", "dateUpdated": "2021-12-29T19:21Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-04"}, "player_id": 1630631}, {"full_name": "Zion Williamson", "shortComment": "Williamson (foot) received an injection in his injured right foot to promote healing and will be re-evaluated in 4-6 weeks, Shams Charania of The Athletic reports.", "longComment": "It's not a great sign that Williamson had to undergo another procedure to promote recovery in his broken right foot. He'll be sidelined for at least another month, and it's looking increasingly unlikely that he'll debut in January.", "dateUpdated": "2021-12-16T19:08Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Foot", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-01-31"}, "player_id": 1629627}, {"full_name": "Kira Lewis Jr.", "shortComment": "Lewis suffered a season-ending torn ACL and Grade 2 MCL sprain in his right knee during the second quarter of Wednesday's contest against the Nuggets, Shams Charania of The Athletic reports.", "longComment": "The sophomore guard ends his season averaging 5.9 points, 2.0 assists and 1.6 rebounds in 14.2 minutes per game. It seems likely his absence will extend into next season. In his place, more minutes should be available for Tomas Satoransky and Garrett Temple.", "dateUpdated": "2021-12-09T19:10Z", "details": {"fantasyStatus": {"description": "out for season", "abbreviation": "OFS"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-10-01"}, "player_id": 1630184}, {"full_name": "Didi Louzada", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-11-20T01:49Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Suspension", "location": "Other", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-11"}, "player_id": 1629712}], "dateUpdated": "2022-01-01 05:55:07.184802"}