{"name": "Orlando Magic", "injuries": [{"full_name": "Mo Bamba", "shortComment": "Bamba (ankle) cleared health and safety protocols Thursday, according to Philip Rossman-Reich of OrlandoMagicDaily.com.", "longComment": "Bamba entered the NBA's health and safety protocols a little less than two weeks ago. As of now, he is trying to re-condition himself after sitting out seven games. Bamba will try returning on Jan. 2 at Boston but remains without a return date or update concerning his right ankle sprain.", "dateUpdated": "2021-12-31T00:44Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Sprain", "side": "Right", "returnDate": "2022-01-02"}, "player_id": 1628964}, {"full_name": "Terrence Ross", "shortComment": "Ross (conditioning) will not play Thursday against Milwaukee, Orlando Magic Daily reports.", "longComment": "Ross looks to have cleared COVID-19 protocols, but the Magic will hold him out Thursday as he works to ramp up his conditioning after missing nearly two full weeks. Thursday will mark the seventh straight absence for Ross, who hasn't played since Dec. 17 against Miami.", "dateUpdated": "2021-12-30T21:06Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 203082}, {"full_name": "Robin Lopez", "shortComment": "Lopez has been ruled out ahead of Thursday's game against the Bucks after landing in the NBA's COVID-19 health and safety protocols, Chris Haynes of Yahoo Sports reports.", "longComment": "Due to a wave of COVID-19-related absences and injuries within the organization, Lopez had seen elevated playing time of late, logging at least 20 minutes while starting in four of the past six games. Lopez now becomes the second Magic player to enter the protocols over the past three days, as point guard Hassani Gravett was pulled midway through Tuesday's loss to the Bucks after he was revealed to have tested positive for the virus. Mo Bamba could be ready to clear the health and safety protocols to play in Thursday's rematch with the Bucks, but if not, Wendell Carter could shift over from power forward and handle most of the minutes at center.", "dateUpdated": "2021-12-30T15:02Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Illness", "location": "Other", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 201577}, {"full_name": "Cole Anthony", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-29T19:32Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Ankle", "location": "Leg", "detail": "Not Specified", "side": "Right", "returnDate": "2022-01-02"}, "player_id": 1630175}, {"full_name": "Jalen Suggs", "shortComment": "Magic head coach Jamahl Mosley said Tuesday that Suggs is progressing slowly through his rehab for the fractured right thumb he suffered Nov. 29,", "longComment": "Though Suggs was fortunate to avoid surgery to address the injury, he still hasn't made much tangible progress in his recovery nearly a month later. Until reports come forth indicating that Suggs is taking part in full-contact, full-court practices, his return to game action shouldn't be viewed as imminent. Fantasy managers should expect Suggs to miss at least a few more contests.", "dateUpdated": "2021-12-29T16:12Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Thumb", "location": "Arm", "detail": "Fracture", "side": "Right", "returnDate": "2022-01-08"}, "player_id": 1630591}, {"full_name": "Markelle Fultz", "shortComment": "Fultz (knee) wasn't available for Tuesday's 127-110 loss to the Bucks and is without a clear timeline for making his 2021-22 debut, Josh Cohen of the Magic's official site reports.", "longComment": "Fultz, who suffered a torn ACL in his left knee Jan. 6, 2021, doesn't look as though he's on track to play less than a year after suffering the devastating injury. That said, Fultz was cleared to resume practicing fully Dec. 10, so he at least appears to have reached the final stage of his extensive rehab program. At this point, Fultz may be in the process of getting reconditioned, and if he remains free of setbacks while doing so, he could be ready to play at some point in January. Expect Fultz to be on a minutes restriction when he eventually returns, and he'll likely have to fill a backup role in the backcourt behind Cole Anthony (ankle) and Jalen Suggs (thumb).", "dateUpdated": "2021-12-29T16:04Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-08"}, "player_id": 1628365}, {"full_name": "E'Twaun Moore", "shortComment": "Moore (knee) wasn't available Tuesday in the Magic's 127-110 loss to the Bucks, Josh Cohen of the Magic's official site reports. The 32-year-old is without a clear timeline for making his season debut.", "longComment": "Moore suffered a sprained left knee during the preseason, and the Magic haven't provided an update on the extent of the injury at any point since the regular season began. Even if Moore makes enough progress in his recovery to suit up at some point in January, he won't be guaranteed a spot in the rotation.", "dateUpdated": "2021-12-29T15:58Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Sprain", "side": "Left", "returnDate": "2022-01-08"}, "player_id": 202734}, {"full_name": "Hassani Gravett", "shortComment": "Gravett was pulled after playing 19 minutes during Tuesday's game against the Bucks and placed in health and safety protocols, Scott Grodsky of CBS 58 reports.", "longComment": "This is potentially bad news for fantasy managers with Magic or Bucks players on the roster, as it seems possible that Gravett was playing while positive for the virus. The league has loosened protocols lately, but it's still likely that anyone who lands in protocols will be out six-plus days.", "dateUpdated": "2021-12-29T02:42Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 1629755}, {"full_name": "Chuma Okeke", "shortComment": "Okeke was placed in the league's health and safety protocols Sunday.", "longComment": "Okeke had started the Magic's previous five games, averaging 11.8 points, 5.2 rebounds, 3.2 steals and 1.6 assists over that span. In his absence, expect Wendell Carter (leg) and Robin Lopez to draw starts in the frontcourt, while Franz Wagner, Admiral Schofield and Aleem Ford operate off the bench during Sunday's matchup with the Heat.", "dateUpdated": "2021-12-26T15:23Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 1629643}, {"full_name": "BJ Johnson", "shortComment": "out", "longComment": "out", "dateUpdated": "2021-12-26T15:22Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}}, {"full_name": "Mychal Mulder", "shortComment": "Mulder was placed in the league's health and safety protocols Wednesday.", "longComment": "Mulder will be one of six players for the Magic to miss Wednesday's contest against the Hawks due to COVID-19 protocols. In his absence, recent G League signees' Hassani Gravett, B.J. Johnson and Admiral Schofield will all be candidates for extended minutes.", "dateUpdated": "2021-12-22T15:16Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 1628539}, {"full_name": "Michael Carter-Williams", "shortComment": "Carter-Williams (ankle) remains out for Wednesday's game against the Hawks.", "longComment": "Carter-Williams is continuing to rehab from the left ankle surgery he underwent in August and is without a clear timeline for making his season debut. Even when healthy, the 30-year-old may have trouble locking in a consistent role for a Magic team that is in the middle of a rebuild.", "dateUpdated": "2021-12-21T21:53Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "Ankle", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-02"}, "player_id": 203487}, {"full_name": "Jonathan Isaac", "shortComment": "Magic president Jeff Weltman said Friday that Isaac is making \"great, steady progress,\" but the forward isn't yet at the point in his rehab program where he's been cleared to take contact in on-court drills, J. Michael of the Orlando Sentinel reports.", "longComment": "Though Isaac underwent surgery Aug. 7, 2020 to address a torn ACL in his left knee, he's seemingly further behind in his recovery from the same knee procedure that teammate Markelle Fultz underwent Jan. 20, 2021. Weltman noted that Fultz, who was spotted taking part in 2-on-2 drills Friday, has been cleared to take contact and will resume practicing in the G League, but Isaac lags further behind the pace with his rehab program. At this point, the Magic haven't provided any sort of timeline for the 24-year-old to make his season debut, and more clarity on that front likely won't come until Isaac is cleared for 5-on-5 scrimmaging in practice. Since Fultz is probably still multiple weeks away from making his own 2021-22 debut, Isaac's absence is looking more and more likely to stretch into the 2022 portion of the Magic's schedule.", "dateUpdated": "2021-11-26T22:20Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-30"}, "player_id": 1628371}], "dateUpdated": "2022-01-01 05:55:07.278529"}