{"name": "Phoenix Suns", "injuries": [{"full_name": "JaVale McGee", "shortComment": "McGee landed in health and safety protocols Thursday, Gerald Bourguet of GoPHNX.com reports.", "longComment": "McGee has appeared in every game for the Suns this season, but that streak will end. In his absence, we could see Jalen Smith start at center.", "dateUpdated": "2021-12-30T23:08Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-06"}, "player_id": 201580}, {"full_name": "Abdel Nader", "shortComment": "Nader (knee) entered health and safety protocols Wednesday, Gerald Bourguet of GoPHNX.com reports.", "longComment": "Nader entered protocols Wednesday when he was already slated to miss his 19th consecutive game due to an ongoing knee injury. There was no clear timetable for the 28-year-old's return from the injury, but this update will likely keep him sidelined for at least a few more games even if his knee injury clears up. Nader joins teammates Jae Crowder and Deandre Ayton in COVID protocols leaving the Suns' frontcourt very thin.", "dateUpdated": "2021-12-30T00:29Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Soreness", "side": "Right", "returnDate": "2022-01-04"}, "player_id": 1627846}, {"full_name": "Deandre Ayton", "shortComment": "Ayton was placed in the league's health and safety protocols Monday, Adrian Wojnarowski of ESPN reports.", "longComment": "It's not yet clear whether Ayton has tested positive for COVID-19 or when he'll be able to return to the court, but he'll be unavailable for Monday's game against Memphis. JaVale McGee, Jalen Smith and Emanuel Terry should see increased work in the frontcourt while Ayton and Jae Crowder are in the COVID-19 protocols.", "dateUpdated": "2021-12-27T22:48Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 1629028}, {"full_name": "Jae Crowder", "shortComment": "Crowder was placed in the league's health and safety protocols Sunday, Adrian Wojnarowski of ESPN reports.", "longComment": "Crowder started each of the first 31 games of the season but will now be forced to miss time due to the league's COVID-19 protocols. Whether he's tested positive for the virus remains to be seen, and a timetable for his return isn't yet known. Cameron Johnson and Jalen Smith should see increased run in Crowder's absence.", "dateUpdated": "2021-12-26T22:37Z", "details": {"fantasyStatus": {"description": "game-time decision", "abbreviation": "GTD"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-02"}, "player_id": 203109}, {"full_name": "Frank Kaminsky", "shortComment": "Kaminsky was seen taking part in stationary shooting drills during Sunday's practice, Gerald Bourguet of GoPHNX.com reports.", "longComment": "The activity is a small sign of progress for Kaminsky, who has been out since mid-November with a stress reaction of his right knee and is without a timeline for a return. Bourguet notes that Kaminsky was limited to taking jumpers off his non-injured left foot, so until he's able to incorporate more running into the mix, his return shouldn't be viewed as imminent.", "dateUpdated": "2021-12-05T19:59Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Fracture", "side": "Right", "returnDate": "2022-01-10"}, "player_id": 1626163}, {"full_name": "Dario Saric", "shortComment": "Saric suffered a torn ACL in his right knee during the first quarter of Game 1 of the NBA Finals, Shams Charania of The Athletic reports.", "longComment": "Saric appeared to injure his knee after a jump shot during the first quarter and never returned to Game 1 of the Finals. It is now being reported that he sustained an ACL tear and will be sidelined indefinitely. It is likely that Frank Kaminsky will see some backup center minutes during the remainder of the Finals, but the Suns may also opt to play small with Cameron Johnson and Torrey Craig.", "dateUpdated": "2021-07-07T18:47Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Knee", "location": "Leg", "detail": "Surgery", "side": "Right", "returnDate": "2022-04-01"}, "player_id": 203967}], "dateUpdated": "2022-01-01 05:55:07.325374"}