{"name": "San Antonio Spurs", "injuries": [{"full_name": "Devontae Cacok", "shortComment": "Cacok was placed in the league's health and safety protocols Wednesday, Bruno Passos of PoundingTheRock.com reports.", "longComment": "Cacok, who has mostly operated in the G League this season, has appeared in each of the Spurs' last two contests. However, he played just a total of 10 minutes during those games, so his absence shouldn't impact the San Antonio's game plan.", "dateUpdated": "2021-12-29T17:44Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-04"}, "player_id": 1629719}, {"full_name": "Dejounte Murray", "shortComment": "Murray was placed in the league's health and safety protocols Sunday, Shams Charania of The Athletic reports.", "longComment": "Murray is in the midst of a career year, averaging 17.8 points, 8.8 assists, 8.4 rebounds and 2.0 steals across 34.2 minutes per game. During his absence, Tre Jones, Derrick White and Lonnie Walker are all expected to see increased minutes.", "dateUpdated": "2021-12-26T17:59Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-01"}, "player_id": 1627749}, {"full_name": "Zach Collins", "shortComment": "Collins said Tuesday that he's avoided any setbacks in his recovery from the left ankle surgery he underwent over the summer, but he remains without a definitive target date to make his season and Spurs debut, Tom Osborn of the San Antonio Express-News reports. \"Just whenever I'm ready, whenever I'm feeling good,\" Collins said, when asked when he might be available to play. \"I haven't played for so long, conditioning and getting the rhythm back is where I am right now.\"", "longComment": "Spurs head coach Gregg Popovich said shortly before the season that Collins likely wouldn't be cleared to play until after Christmastime, and that still appears to be the case more than two months later. Collins initially sustained a stress reaction of his left ankle while playing for Portland at the NBA bubble in Orlando in the summer of 2020 and underwent surgery that August, then required a follow-up procedure in late December of that year. He had been gearing up for a return late in the 2020-21 campaign, only to fracture the same ankle again in late June while rehabbing. Despite Collins' sketchy track record on the health front, the Spurs still recognized enough potential in the 2017 lottery pick to sign him to a three-year deal this summer. Even so, Collins will likely face significant limitations whenever he's ready to suit up for the Spurs, presumably sitting out one half of back-to-back sets while having a minute restriction in place.", "dateUpdated": "2021-12-15T17:19Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Ankle", "location": "Leg", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-09"}, "player_id": 1628380}], "dateUpdated": "2022-01-01 05:55:07.372239"}