{"name": "Washington Wizards", "injuries": [{"full_name": "Davis Bertans", "shortComment": "Bertans (illness) has been ruled out for Saturday's game against Chicago.", "longComment": "Bertans will be forced to miss a second consecutive game with a non-COVID illness. Deni Avdija should see increased run once again.", "dateUpdated": "2021-12-31T23:39Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "Illness", "location": "Other", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 202722}, {"full_name": "Brad Wanamaker", "shortComment": "Wanamaker was placed in the league's health and safety protocols Friday, Shams Charania of The Athletic reports.", "longComment": "Wanamaker drew the start at point guard during his first game with the Wizards, posting seven points, seven assists, five rebounds and two steals. In his absence, rookie Corey Kispert and two-way players Joel Ayayi and Cassius Winston are all candidates to enter the starting lineup.", "dateUpdated": "2021-12-31T17:36Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "returnDate": "2022-01-05"}, "player_id": 202954}, {"full_name": "Spencer Dinwiddie", "shortComment": "Dinwiddie entered health and safety protocols Thursday, Shams Charania of The Athletic reports.", "longComment": "With Bradley Beal (COVID-19 protocols) questionable, the Wizards could end up shorthanded Thursday against the Cavaliers. For the duration of Dinwiddie's absence, more minutes could be available for Joe Ayayi, Cassius Winston and Brad Wanamaker until Raul Neto and Aaron Holiday both return from protocols.", "dateUpdated": "2021-12-30T20:38Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 203915}, {"full_name": "Rui Hachimura", "shortComment": "Hachimura was placed in the league's health and safety protocols Tuesday, Adrian Wojnarowski of ESPN reports.", "longComment": "Hachimura was on the cusp of making his 2021-22 debut after a personal issue kept him away from the team for the start of the season. However, after his latest setback, the 2019 first-round pick likely won't see the court until the calendar flips to 2022.", "dateUpdated": "2021-12-28T17:30Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-07"}, "player_id": 1629060}, {"full_name": "Montrezl Harrell", "shortComment": "Harrell was placed in the NBA's COVID-19 protocols Tuesday, Adrian Wojnarowski of ESPN reports.", "longComment": "Washington now has seven players currently in protocols after Harrell and Rui Hachimura were added to the list Tuesday morning. Harrell figures to miss at least the next six days, effectively ruling him out for the entirety of the Wizards' three-game Week 11 schedule.", "dateUpdated": "2021-12-28T17:02Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1626149}, {"full_name": "Aaron Holiday", "shortComment": "Holiday was placed in COVID-19 protocols Monday, Wizards insider Quinton Mayo reports.", "longComment": "Holiday joins Kentavious Caldwell-Pope, Raul Neto, Bradley Beal, Anthony Gill and Thomas Bryant in health and safety protocols, so the Wizards will be down another backcourt piece as they head into a three-game Week 11. Five of those six players have been ruled out of Tuesday's game at Miami, but there's hope that Beal will be cleared to return over the next 24 hours. Based on the NBA's updated quarantine procedures, Holiday could be cleared to return to the team after as few as six days.", "dateUpdated": "2021-12-27T22:54Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-03"}, "player_id": 1628988}, {"full_name": "Thomas Bryant", "shortComment": "Bryant (knee) was placed in the league's  COVID-19 health and safety protocols Monday, Josh Robbins of The Athletic reports.", "longComment": "Bryant is already sidelined as he works back from a torn ACL, so while this isn't the most encouraging development, it shouldn't necessarily affect his return-to-play timetable. The big man returned to practice prior to Christmas and is in the latter stages of his recovery, so the hope is that he can make his 2021-22 debut sometime in early-to-mid January. At that point, he'll compete with Daniel Gafford, Rui Hachimura (personal), Montrezl Harrell and Davis Bertans, among a few others, for frontcourt minutes.", "dateUpdated": "2021-12-27T18:02Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Surgery", "side": "Left", "returnDate": "2022-01-05"}, "player_id": 1628418}, {"full_name": "Raul Neto", "shortComment": "Neto was placed in the NBA's health and safety protocols Sunday.", "longComment": "Neto joins Bradley Beal and Kentavious Caldwell-Pope as they Wizards players currently in the NBA's COVID-19 protocols. The 29-year-old has played valuable minutes off the bench this season, averaging 7.8 points, 2.6 assists and two rebounds in 20.2 minutes per game. Cassius Winston could vault into the rotation for the time being until the team can get some of their guards back in action.", "dateUpdated": "2021-12-26T21:43Z", "details": {"fantasyStatus": {"description": "out", "abbreviation": "OUT"}, "type": "General Soreness", "detail": "Not Specified", "side": "Not Specified", "returnDate": "2022-01-05"}, "player_id": 203526}], "dateUpdated": "2022-01-01 05:55:07.450344"}